dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
static void mqtt_vad_min_speech_callback(const char *entity_id, const char *payload)
{
    float value = atof(payload);
    vad_min_speech = (uint32_t)value;
    ESP_LOGI(TAG, "MQTT: VAD min speech updated to %lums", vad_min_speech);
    mqtt_ha_update_number("vad_min_speech", (float)vad_min_speech);
}

static void mqtt_vad_max_recording_callback(const char *entity_id, const char *payload)
{
    float value = atof(payload);
    vad_max_recording = (uint32_t)value;
    ESP_LOGI(TAG, "MQTT: VAD max recording updated to %lums", vad_max_recording);
    mqtt_ha_update_number("vad_max_recording", (float)vad_max_recording);
}

static void mqtt_wwd_threshold_callback(const char *entity_id, const char *payload)
{
    wwd_threshold = atof(payload);
    ESP_LOGI(TAG, "MQTT: WWD threshold updated to %.2f", wwd_threshold);

    // Apply to WakeNet immediately if running
    if (wwd_is_running()) {
        wwd_stop();
        audio_capture_stop();
        vTaskDelay(pdMS_TO_TICKS(100));

        wwd_config_t wwd_config = wwd_get_default_config();
        wwd_config.callback = on_wake_word_detected;
        wwd_config.user_data = NULL;
        wwd_config.detection_threshold = wwd_threshold;

        esp_err_t ret = wwd_init(&wwd_config);
        if (ret == ESP_OK) {
            wwd_start();
            audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
            ESP_LOGI(TAG, "WWD restarted with new threshold");
        } else {
            ESP_LOGE(TAG, "Failed to restart WWD with new threshold");
        }
    }

    mqtt_ha_update_number("wwd_threshold", wwd_threshold);
}

// MQTT status update task
static void mqtt_status_update_task(void *arg)
{
    while (1) {
        if (mqtt_ha_is_connected()) {
            // Update WiFi RSSI
            // Note: Would need wifi_manager API to get RSSI
            mqtt_ha_update_sensor("wifi_rssi", "-45");

            // Update free memory
            char mem_str[32];
            uint32_t free_mem = esp_get_free_heap_size() / 1024; // KB
            snprintf(mem_str, sizeof(mem_str), "%lu", (unsigned long)free_mem);
            mqtt_ha_update_sensor("free_memory", mem_str);

            // Update uptime
            char uptime_str[32];
            uint32_t uptime_sec = esp_log_timestamp() / 1000;
            snprintf(uptime_str, sizeof(uptime_str), "%lu", (unsigned long)uptime_sec);
            mqtt_ha_update_sensor("uptime", uptime_str);

            // Update WWD state
            mqtt_ha_update_switch("wwd_enabled", wwd_is_running());

            // Update network status
            char ip_str[16];
            if (network_manager_get_ip(ip_str) == ESP_OK) {
                mqtt_ha_update_sensor("ip_address", ip_str);
            }
            mqtt_ha_update_sensor("network_type", network_manager_type_to_string(network_manager_get_active_type()));

            // Update SD card status
            if (bsp_sdcard != NULL) {
                mqtt_ha_update_sensor("sd_card_status", "mounted");
            } else {
                mqtt_ha_update_sensor("sd_card_status", "not_mounted");
            }

            // Update music player status
            if (local_music_player_is_initialized()) {
                // Update music state
                music_state_t state = local_music_player_get_state();
                const char *state_str;
                switch (state) {
                    case MUSIC_STATE_PLAYING:
                        state_str = "playing";
                        break;
                    case MUSIC_STATE_PAUSED:
                        state_str = "paused";
                        break;
                    case MUSIC_STATE_STOPPED:
                        state_str = "stopped";
                        break;
                    default:
                        state_str = "idle";
                        break;
                }
                mqtt_ha_update_sensor("music_state", state_str);

                // Update current track
                char track_name[64];
                if (local_music_player_get_track_name(track_name, sizeof(track_name)) == ESP_OK) {
                    mqtt_ha_update_sensor("current_track", track_name);
                } else {
                    mqtt_ha_update_sensor("current_track", "No track");
                }

                // Update total tracks
                char total_tracks_str[16];
                snprintf(total_tracks_str, sizeof(total_tracks_str), "%d",
                         local_music_player_get_total_tracks());
                mqtt_ha_update_sensor("total_tracks", total_tracks_str);
            } else {
                mqtt_ha_update_sensor("music_state", "unavailable");
                mqtt_ha_update_sensor("current_track", "N/A");
                mqtt_ha_update_sensor("total_tracks", "0");
            }

            // Update configuration numbers (only on first iteration or when changed)
            static bool config_published = false;
            if (!config_published) {
                mqtt_ha_update_number("vad_threshold", (float)vad_threshold);
                mqtt_ha_update_number("vad_silence_duration", (float)vad_silence_duration);
                mqtt_ha_update_number("vad_min_speech", (float)vad_min_speech);
                mqtt_ha_update_number("vad_max_recording", (float)vad_max_recording);
                mqtt_ha_update_number("wwd_threshold", wwd_threshold);
                config_published = true;
            }
        }

        vTaskDelay(pdMS_TO_TICKS(10000)); // Update every 10 seconds
    }
}

// Wake word detection callback
static void on_wake_word_detected(wwd_event_t event, void *user_data)
{
    if (event == WWD_EVENT_DETECTED) {
        ESP_LOGI(TAG, "🎤 Wake word detected!");

        // Stop wake word detection
        wwd_stop();

        // Stop audio capture (from wake word mode)
        audio_capture_stop();
        ESP_LOGI(TAG, "Wake word mode stopped");

        // Small delay to ensure capture task fully exits
        vTaskDelay(pdMS_TO_TICKS(100));

        // Play beep tone as audio feedback (800Hz, 120ms, 40% volume)
        ESP_LOGI(TAG, "🔊 Playing wake word confirmation beep...");
        extern esp_err_t beep_tone_play(uint16_t frequency, uint16_t duration, uint8_t volume);
        esp_err_t beep_ret = beep_tone_play(800, 120, 40);
        if (beep_ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to play beep tone: %s", esp_err_to_name(beep_ret));
        }

        // Small delay after beep before starting recording
        vTaskDelay(pdMS_TO_TICKS(50));

