dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
        ESP_LOGI(TAG, "Starting voice pipeline...");

        // Start voice assistant pipeline
        test_audio_streaming();
    }
}

// Wrapper function to feed audio to wake word detector
static void wwd_audio_feed_wrapper(const int16_t *audio_data, size_t samples)
{
    wwd_feed_audio(audio_data, samples);
}

static void tts_playback_complete_handler(void)
{
    ESP_LOGI(TAG, "🔄 TTS playback complete - resuming wake word detection...");

    // Resume wake word detection
    wwd_start();
    audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);

    ESP_LOGI(TAG, "✅ Wake word detection resumed - ready for next command");
}

static void vad_event_handler(audio_capture_vad_event_t event)
{
    switch (event) {
        case VAD_EVENT_SPEECH_START:
            ESP_LOGI(TAG, "🎤 Speech detected - recording...");
            break;

        case VAD_EVENT_SPEECH_END:
            ESP_LOGI(TAG, "🔇 Silence detected - VAD auto-stop triggered");
            ESP_LOGI(TAG, "Total audio chunks sent: %d", audio_chunks_sent);

            // Mark pipeline as inactive to stop sending audio chunks
            pipeline_active = false;

            // Stop audio capture immediately to free I2S for TTS playback
            audio_capture_stop();
            ESP_LOGI(TAG, "Audio capture stopped - I2S freed for TTS");

            // End audio stream to HA
            ha_client_end_audio_stream();

            // Cleanup pipeline handler
            if (pipeline_handler != NULL) {
                free(pipeline_handler);
                pipeline_handler = NULL;
            }
            audio_chunks_sent = 0;

            // WWD will be resumed AFTER TTS playback completes (via callback)
            ESP_LOGI(TAG, "Waiting for TTS playback to complete before resuming WWD...");
            break;
    }
}

static void audio_capture_handler(const uint8_t *audio_data, size_t length)
{
    // Check if pipeline is still active
    if (!pipeline_active || pipeline_handler == NULL) {
        return;  // Pipeline closed or not started
    }

    // Validate audio data
    if (audio_data == NULL || length == 0) {
        return;
    }

    // Skip warmup chunks to avoid wake word remnants
    if (warmup_chunks_skip > 0) {
        warmup_chunks_skip--;
        ESP_LOGD(TAG, "Skipping warmup chunk (%d remaining)", warmup_chunks_skip);
        return;
    }

    // Stream audio to HA
    esp_err_t ret = ha_client_stream_audio(audio_data, length, pipeline_handler);
    if (ret == ESP_OK) {
        audio_chunks_sent++;
    } else {
        ESP_LOGW(TAG, "Failed to stream audio chunk - pipeline may be closed");
    }
}

static void test_audio_streaming(void)
{
    ESP_LOGI(TAG, "========================================");
    ESP_LOGI(TAG, "Starting Audio Streaming Test with VAD");
    ESP_LOGI(TAG, "========================================");

    // Configure VAD with dynamic settings (adjustable via MQTT)
    vad_config_t vad_config = {
        .sample_rate = 16000,
        .speech_threshold = vad_threshold,
        .silence_duration_ms = vad_silence_duration,
        .min_speech_duration_ms = vad_min_speech,
        .max_recording_ms = vad_max_recording
    };

    ESP_LOGI(TAG, "📊 VAD Config: threshold=%lu, silence=%lums, min_speech=%lums, max=%lums",
             vad_config.speech_threshold,
             vad_config.silence_duration_ms,
             vad_config.min_speech_duration_ms,
             vad_config.max_recording_ms);

    // Enable VAD with event callback
    esp_err_t ret = audio_capture_enable_vad(&vad_config, vad_event_handler);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable VAD");
        return;
    }

    // Start Assist Pipeline
    pipeline_handler = ha_client_start_conversation();
    if (pipeline_handler == NULL) {
        ESP_LOGE(TAG, "Failed to start pipeline");
        return;
    }

    ESP_LOGI(TAG, "Pipeline started: %s", pipeline_handler);
    ESP_LOGI(TAG, "🎙️  Start speaking now! (VAD will auto-stop after silence)");

    // Reset counters and mark pipeline as active
    audio_chunks_sent = 0;
    pipeline_active = true;
    warmup_chunks_skip = 10;  // Skip first 10 chunks (~640ms) to clear wake word remnants

    // Reset VAD state
    audio_capture_reset_vad();

    // Start capturing and streaming audio
    ret = audio_capture_start(audio_capture_handler);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start audio capture");
        free(pipeline_handler);
        pipeline_handler = NULL;
    }
}

void app_main(void)
{
    ESP_LOGI(TAG, "===== ESP32-P4 Voice Assistant Starting =====");

    // Initialize NVS (required for WiFi)
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    ESP_LOGI(TAG, "NVS initialized");

    // Initialize audio codec
    ESP_LOGI(TAG, "Initializing ES8311 audio codec...");
    ESP_ERROR_CHECK(bsp_extra_codec_init());
    bsp_extra_codec_volume_set(40,NULL);
    bsp_extra_player_init();
    ESP_LOGI(TAG, "ES8311 codec initialized successfully");

    // Initialize TTS player
    ESP_LOGI(TAG, "Initializing TTS player...");
    ret = tts_player_init();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "TTS player initialization failed");
    } else {
        ESP_LOGI(TAG, "TTS player initialized successfully");
    }

    // Initialize audio capture
    ESP_LOGI(TAG, "Initializing audio capture...");
    ret = audio_capture_init();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Audio capture initialization failed");
    } else {
        ESP_LOGI(TAG, "Audio capture initialized successfully");
    }

    // Note: SD card not mounted - using WakeNet models from flash instead
    // The ESP32-P4 Function EV Board's SD card slot uses SDIO pins that are
    // already occupied by the ESP32-C6 WiFi module. WakeNet9 models are loaded
    // directly from the esp-sr managed component directory in flash memory.
    ESP_LOGI(TAG, "WakeNet models will be loaded from flash (managed_components)");

