dvucinozd/JC-ESP32P4-M3-DEV-Voice-Assistant-V2/main/mp3_player.c
    // Initialize Wake Word Detection
    ESP_LOGI(TAG, "Initializing Wake Word Detection...");
    wwd_config_t wwd_config = wwd_get_default_config();
    wwd_config.callback = on_wake_word_detected;
    wwd_config.user_data = NULL;
    wwd_config.detection_threshold = wwd_threshold;  // Dynamic threshold (adjustable via MQTT)
    ESP_LOGI(TAG, "WWD threshold: %.2f, VAD threshold: %lu", wwd_threshold, vad_threshold);
    esp_err_t wwd_ret = wwd_init(&wwd_config);

    if (wwd_ret != ESP_OK) {
        ESP_LOGE(TAG, "Wake Word Detection initialization failed!");
        ESP_LOGW(TAG, "Falling back to VAD-based activation");
    } else {
        ESP_LOGI(TAG, "Wake Word Detection initialized successfully!");
    }

    // Initialize Network Manager (Ethernet priority + WiFi fallback)
    ESP_LOGI(TAG, "Initializing Network Manager...");
    network_manager_register_callback(network_event_callback);
    ret = network_manager_init();
    if(ret == ESP_OK && network_manager_is_connected()) {
        ESP_LOGI(TAG, "Network connected successfully!");
        ESP_LOGI(TAG, "Active network: %s", network_manager_type_to_string(network_manager_get_active_type()));

        // Initialize Home Assistant client
        ESP_LOGI(TAG, "Connecting to Home Assistant...");
        ret = ha_client_init();
        if(ret == ESP_OK) {
            ESP_LOGI(TAG, "Home Assistant connected successfully!");

            // Register callbacks
            ha_client_register_conversation_callback(conversation_response_handler);
            ha_client_register_tts_audio_callback(tts_audio_handler);
            tts_player_register_complete_callback(tts_playback_complete_handler);

            // Initialize MQTT Home Assistant Discovery
            ESP_LOGI(TAG, "Initializing MQTT Home Assistant Discovery...");
            mqtt_ha_config_t mqtt_config = {
                .broker_uri = MQTT_BROKER_URI,
                .username = MQTT_USERNAME,
                .password = MQTT_PASSWORD,
                .client_id = MQTT_CLIENT_ID
            };

            ret = mqtt_ha_init(&mqtt_config);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "MQTT client initialized");

                // Start MQTT client
                ret = mqtt_ha_start();
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "MQTT client started");

                    // Wait for MQTT connection
                    vTaskDelay(pdMS_TO_TICKS(2000));

                    // Register entities with Home Assistant
                    ESP_LOGI(TAG, "Registering Home Assistant entities...");

                    // Sensors
                    mqtt_ha_register_sensor("network_type", "Network Type", NULL, NULL);
                    mqtt_ha_register_sensor("ip_address", "IP Address", NULL, NULL);
                    mqtt_ha_register_sensor("sd_card_status", "SD Card Status", NULL, NULL);
                    mqtt_ha_register_sensor("wifi_rssi", "WiFi Signal", "dBm", "signal_strength");
                    mqtt_ha_register_sensor("free_memory", "Free Memory", "KB", NULL);
                    mqtt_ha_register_sensor("uptime", "Uptime", "s", "duration");

                    // Switches
                    mqtt_ha_register_switch("wwd_enabled", "Wake Word Detection", mqtt_wwd_switch_callback);

                    // Buttons - System
                    mqtt_ha_register_button("restart", "Restart Device", mqtt_restart_callback);
                    mqtt_ha_register_button("test_tts", "Test TTS", mqtt_test_tts_callback);

                    // Buttons - Music Player
                    mqtt_ha_register_button("music_play", "Play Music", mqtt_music_play_callback);
                    mqtt_ha_register_button("music_stop", "Stop Music", mqtt_music_stop_callback);
                    mqtt_ha_register_button("music_pause", "Pause Music", mqtt_music_pause_callback);
                    mqtt_ha_register_button("music_resume", "Resume Music", mqtt_music_resume_callback);
                    mqtt_ha_register_button("music_next", "Next Track", mqtt_music_next_callback);
                    mqtt_ha_register_button("music_previous", "Previous Track", mqtt_music_previous_callback);

                    // Sensors - Music Player
                    mqtt_ha_register_sensor("music_state", "Music State", NULL, NULL);
                    mqtt_ha_register_sensor("current_track", "Current Track", NULL, NULL);
                    mqtt_ha_register_sensor("total_tracks", "Total Tracks", NULL, NULL);

                    // Number controls for VAD tuning
                    mqtt_ha_register_number("vad_threshold", "VAD Speech Threshold",
                                           50, 300, 10, NULL, mqtt_vad_threshold_callback);
                    mqtt_ha_register_number("vad_silence_duration", "VAD Silence Duration",
                                           1000, 3000, 100, "ms", mqtt_vad_silence_callback);
                    mqtt_ha_register_number("vad_min_speech", "VAD Min Speech Duration",
                                           100, 500, 50, "ms", mqtt_vad_min_speech_callback);
                    mqtt_ha_register_number("vad_max_recording", "VAD Max Recording Duration",
                                           5000, 10000, 500, "ms", mqtt_vad_max_recording_callback);

                    // Number control for WWD tuning
                    mqtt_ha_register_number("wwd_threshold", "WWD Detection Threshold",
                                           0.3, 0.9, 0.05, NULL, mqtt_wwd_threshold_callback);

                    ESP_LOGI(TAG, "Home Assistant entities registered (9 sensors, 1 switch, 8 buttons, 5 numbers)");

                    // Start MQTT status update task
                    xTaskCreate(mqtt_status_update_task, "mqtt_status", 4096, NULL, 3, NULL);
                    ESP_LOGI(TAG, "MQTT status update task started");
                } else {
                    ESP_LOGW(TAG, "Failed to start MQTT client");
                }
            } else {
                ESP_LOGW(TAG, "Failed to initialize MQTT client");
            }

            // Start wake word detection if initialized successfully
            if (wwd_ret == ESP_OK && wwd_is_running() == false) {
                ESP_LOGI(TAG, "========================================");
                ESP_LOGI(TAG, "🎙️  Voice Assistant Ready!");
                ESP_LOGI(TAG, "Wake Word Detection enabled");
                ESP_LOGI(TAG, "Say the wake word to activate!");
                ESP_LOGI(TAG, "Wake word: 'Hi ESP' (or your chosen model)");
                ESP_LOGI(TAG, "========================================");

                // Start wake word detection
                wwd_start();
                audio_capture_start_wake_word_mode(wwd_audio_feed_wrapper);
            } else {
                // Fallback to VAD-based activation
                ESP_LOGI(TAG, "========================================");
                ESP_LOGI(TAG, "🎙️  Voice Assistant Ready!");
                ESP_LOGI(TAG, "Using VAD-based activation");
                ESP_LOGI(TAG, "System will start recording in 5 seconds...");
                ESP_LOGI(TAG, "Just start speaking - VAD will detect automatically!");
                ESP_LOGI(TAG, "========================================");
                vTaskDelay(pdMS_TO_TICKS(5000));
                test_audio_streaming();
            }
        } else {
            ESP_LOGW(TAG, "Home Assistant connection failed");
        }
    } else {
        ESP_LOGW(TAG, "WiFi connection failed, continuing without network");
    }

    // SD card MP3 playback disabled - focusing on Voice Assistant functionality
    // TODO: Fix file_iterator crash issue before re-enabling
    ESP_LOGI(TAG, "MP3 playback disabled (Voice Assistant mode)");
    ESP_LOGI(TAG, "Audio codec is ready for Voice Assistant development");
    ESP_LOGI(TAG, "System idle - ready to process voice commands...");

    // Keep the system running for HA communication
    while(1) {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }

}
